In [5]:
#importing liberaries 
import pandas as pd
import numpy as np
import seaborn as sns
import matplotlib.pyplot as plt
%matplotlib inline

In [25]:
# uploading data set
dataset = pd.read_csv('dataset1.csv')
dataset.shape

(925, 8)

In [26]:
# exploring data set 
dataset.head(5)

   target    var1     var2          var3   var4    var5 var6              var7
0       0  509.18  417.681    Micronesia  138.0  393.00   no  20/07/2019 13:21
1       0  446.06  666.182      Dominica   81.0  352.05  yes  04/04/2019 21:30
2       1  235.50  398.097   Isle of Man   90.0  339.00   no  03/03/2019 02:59
3       0  306.02  518.163  Turkmenistan  102.0  439.25  yes  19/03/2019 08:00
4       0  453.08  600.156      Cameroon  105.0  422.95   no  18/03/2019 13:22

In [27]:
#discribing dataset statistics 
dataset.describe()

           target        var1        var2        var4        var5
count  925.000000  925.000000  925.000000  325.000000  925.000000
mean     0.496216  360.116562  548.390134  108.452308  325.393946
std      0.500256   87.866662  135.221460   26.325744   78.862779
min      0.000000  209.560000  139.965000   57.000000  163.000000
25%      0.000000  278.640000  467.373000   87.000000  257.900000
50%      0.000000  367.640000  569.841000  105.000000  342.350000
75%      1.000000  437.600000  652.278000  126.000000  393.000000
max      1.000000  539.920000  794.848000  180.000000  457.150000

In [28]:
#checking missing values in data set
missing_values_total = dataset.isnull().sum()
print("Missing values in the entire dataset:")
print(missing_values_total)

Missing values in the entire dataset:
target      0
var1        0
var2        0
var3        0
var4      600
var5        0
var6        0
var7        0
dtype: int64

In [29]:
#missing value in a var4
missing_values_specific = dataset[["var4"]].isnull().sum()
print("\nMissing values in specific columns:")
print(missing_values_specific)

Missing values in specific columns:
var4    600
dtype: int64

In [30]:
# Print rows with missing values
rows_with_missing_values = dataset[dataset.isnull().any(axis=1)]
print("\nRows with missing values:")
print(rows_with_missing_values)

Rows with missing values:
     target    var1     var2                var3  var4    var5 var6  \
325       1  304.98  492.700              Bhutan   NaN  444.85  yes
326       1  302.36  515.935          Micronesia   NaN  177.75  yes
327       1  261.68  386.454  Dominican Republic   NaN  412.45  yes
328       1  317.60  155.983          Azerbaijan   NaN  323.15   no
329       0  465.08  606.384                Niue   NaN  421.45  yes
..      ...     ...      ...                 ...   ...     ...  ...
920       0  422.34  547.259             Belarus   NaN  350.45  yes
921       1  342.62  473.919               Japan   NaN  200.85   no
922       1  265.10  538.170        Saint Martin   NaN  208.35  yes
923       0  397.12  622.386                Chad   NaN  433.45  yes
924       1  242.10  420.429             Albania   NaN  369.20  yes

                 var7
325  11/06/2019 18:32
326  13/01/2019 20:38
327  31/05/2019 00:58
328  12/06/2019 03:11
329  27/01/2019 20:47
..                ...
920  22/01/2019 12:58
921  01/02/2019 14:37
922  13/06/2019 18:50
923  27/05/2019 06:19
924  18/06/2019 17:23

[600 rows x 8 columns]

In [36]:
mean_value = dataset['var4'].mean()
print("The mean value of the column is:", mean_value)

The mean value of the column is: 108.4523076923077

In [40]:
# Fill missing values in column 'var4' with the calculated mean
dataset['var4'].fillna(var4_mean, inplace=True)

In [41]:
dataset.head(326)

,target,var1,var2,var3,var4,var5,var6,var7
0,0,509.18,417.681,Micronesia,138.000000,393.00,no,20/07/2019 13:21
1,0,446.06,666.182,Dominica,81.000000,352.05,yes,04/04/2019 21:30
2,1,235.50,398.097,Isle of Man,90.000000,339.00,no,03/03/2019 02:59
3,0,306.02,518.163,Turkmenistan,102.000000,439.25,yes,19/03/2019 08:00
4,0,453.08,600.156,Cameroon,105.000000,422.95,no,18/03/2019 13:22
...,...,...,...,...,...,...,...,...
321,1,303.44,461.976,Peru,135.000000,178.30,yes,29/04/2019 14:08
322,1,273.18,687.378,Turkmenistan,117.000000,249.75,yes,24/03/2019 09:12
323,0,385.00,597.976,Slovakia (Slovak Republic),87.000000,425.05,yes,03/05/2019 16:02
324,1,283.92,488.677,Martinique,84.000000,220.75,no,22/01/2019 15:03
325,1,304.98,492.700,Bhutan,108.452308,444.85,yes,11/06/2019 18:32

In [42]:
#checking missing values
missing_values_total = dataset.isnull().sum()
print("Missing values in the entire dataset:")
print(missing_values_total)

Missing values in the entire dataset:
target    0
var1      0
var2      0
var3      0
var4      0
var5      0
var6      0
var7      0
dtype: int64

In [43]:
# Check data types of each column
column_data_types = dataset.dtypes
print("Data types of each column:")
print(column_data_types)
# question do i need to change target an dvar6 into boolean and var 7 into date time format

Data types of each column:
target      int64
var1      float64
var2      float64
var3       object
var4      float64
var5      float64
var6       object
var7       object
dtype: object

In [44]:
dataset.head(5)

   target    var1     var2          var3   var4    var5 var6              var7
0       0  509.18  417.681    Micronesia  138.0  393.00   no  20/07/2019 13:21
1       0  446.06  666.182      Dominica   81.0  352.05  yes  04/04/2019 21:30
2       1  235.50  398.097   Isle of Man   90.0  339.00   no  03/03/2019 02:59
3       0  306.02  518.163  Turkmenistan  102.0  439.25  yes  19/03/2019 08:00
4       0  453.08  600.156      Cameroon  105.0  422.95   no  18/03/2019 13:22

In [19]:
# changing data type of target column
dataset['var3'] = dataset['var3'].astype(str)

In [20]:
dataset = dataset.convert_dtypes()

In [21]:
print(dataset.columns.tolist())

['target', 'var1', 'var2', 'var3', 'var4', 'var5', 'var6', 'var7']

In [46]:
# Convert categorical variables to numerical using one-hot encoding
dataset = pd.get_dummies(dataset, drop_first=True)

In [50]:
# Standardize numerical features

from sklearn.preprocessing import LabelEncoder, StandardScaler
numerical_features = dataset.select_dtypes(include=['float64', 'int64']).columns
scaler = StandardScaler()
dataset[numerical_features] = scaler.fit_transform(dataset[numerical_features])

In [52]:
# Display the preprocessed dataset
print("\nPreprocessed data:")
print(dataset.head())

Preprocessed data:
     target      var1      var2      var4      var5  var3_Albania  \
0 -0.992461  1.697391 -0.967153  1.896449  0.857726             0
1 -0.992461  0.978641  0.871575 -1.761962  0.338188             0
2  1.007596 -1.419013 -1.112060 -1.184318  0.172622             0
3 -0.992461 -0.616000 -0.223659 -0.414126  1.444505             0
4 -0.992461  1.058578  0.383030 -0.221578  1.237705             0

   var3_Algeria  var3_American Samoa  var3_Andorra  var3_Angola  ...  \
0             0                    0             0            0  ...
1             0                    0             0            0  ...
2             0                    0             0            0  ...
3             0                    0             0            0  ...
4             0                    0             0            0  ...

   var7_31/03/2019 20:55  var7_31/05/2019 00:58  var7_31/05/2019 02:17  \
0                      0                      0                      0
1                      0                      0                      0
2                      0                      0                      0
3                      0                      0                      0
4                      0                      0                      0

   var7_31/05/2019 06:21  var7_31/05/2019 09:06  var7_31/05/2019 11:44  \
0                      0                      0                      0
1                      0                      0                      0
2                      0                      0                      0
3                      0                      0                      0
4                      0                      0                      0

   var7_31/05/2019 17:50  var7_31/05/2019 21:41  var7_31/05/2019 23:32  \
0                      0                      0                      0
1                      0                      0                      0
2                      0                      0                      0
3                      0                      0                      0
4                      0                      0                      0

   var7_31/05/2019 23:42
0                      0
1                      0
2                      0
3                      0
4                      0

[5 rows x 1163 columns]

In [54]:
# Save the preprocessed dataset to a new file
preprocessed_file_path = "preprocessed_dataset1.csv"
dataset.to_csv(preprocessed_file_path, index=False)
print(f"\nPreprocessed data saved to {preprocessed_file_path}")

Preprocessed data saved to preprocessed_dataset1.csv

In [58]:
from sklearn.model_selection import train_test_split

# Check column names
print(dataset.columns)

# Ensure 'var3' exists in the DataFrame
if 'target' in dataset.columns:
    # Split the data into training and testing sets
    X = dataset.drop('target', axis=1)
    y = dataset['target']
    X_train, X_test, y_train, y_test = train_test_split(X, y, test_size=0.2, random_state=42)
else:
    print("Error: 'var3' not found in DataFrame columns.")

Index(['target', 'var1', 'var2', 'var4', 'var5', 'var3_Albania',
       'var3_Algeria', 'var3_American Samoa', 'var3_Andorra', 'var3_Angola',
       ...
       'var7_31/03/2019 20:55', 'var7_31/05/2019 00:58',
       'var7_31/05/2019 02:17', 'var7_31/05/2019 06:21',
       'var7_31/05/2019 09:06', 'var7_31/05/2019 11:44',
       'var7_31/05/2019 17:50', 'var7_31/05/2019 21:41',
       'var7_31/05/2019 23:32', 'var7_31/05/2019 23:42'],
      dtype='object', length=1163)

In [59]:
import pandas as pd
from sklearn.model_selection import train_test_split
from sklearn.preprocessing import StandardScaler, LabelEncoder
from sklearn.linear_model import LogisticRegression
from sklearn.tree import DecisionTreeClassifier
from sklearn.ensemble import RandomForestClassifier
from sklearn.metrics import accuracy_score, classification_report

In [62]:
# Split the data into training and testing sets
X = dataset.drop('target', axis=1)
y = dataset['target']
X_train, X_test, y_train, y_test = train_test_split(X, y, test_size=0.2, random_state=42)

# Ensure the target variable is of integer type for classification models
y_train = y_train.astype('int')
y_test = y_test.astype('int')

# Choose a classification model (example: Logistic Regression)
model = LogisticRegression()

# Train the model
model.fit(X_train, y_train)

# Make predictions
y_pred = model.predict(X_test)

# Evaluate the model
print("Model Accuracy:", accuracy_score(y_test, y_pred))
print("Classification Report:\n", classification_report(y_test, y_pred))

Model Accuracy: 0.9513513513513514
Classification Report:
               precision    recall  f1-score   support

           0       0.96      0.95      0.95        97
           1       0.94      0.95      0.95        88

    accuracy                           0.95       185
   macro avg       0.95      0.95      0.95       185
weighted avg       0.95      0.95      0.95       185

In [ ]:
#Fine-tune the selected model using appropriate techniques (eg, hyperparameter tuning, cross-validation, etc).

In [63]:
from sklearn.linear_model import LogisticRegression
from sklearn.model_selection import GridSearchCV, cross_val_score

# Define the model
model = LogisticRegression()

# Define the hyperparameters and their ranges
param_grid = {'C': [0.001, 0.01, 0.1, 1, 10, 100], 'penalty': ['l1', 'l2']}

# Set up the grid search
grid_search = GridSearchCV(model, param_grid, cv=5, scoring='accuracy')

# Fit the grid search to the data
grid_search.fit(X_train, y_train)

# Get the best model
best_model = grid_search.best_estimator_

# Evaluate the best model using cross-validation
scores = cross_val_score(best_model, X_train, y_train, cv=5)

print(f"Best model parameters: {grid_search.best_params_}")
print(f"Cross-validation scores: {scores}")

C:\Users\irams\anaconda3\lib\site-packages\sklearn\model_selection\_validation.py:378: FitFailedWarning:
30 fits failed out of a total of 60.
The score on these train-test partitions for these parameters will be set to nan.
If these failures are not expected, you can try to debug them by setting error_score='raise'.

Below are more details about the failures:
--------------------------------------------------------------------------------
30 fits failed with the following error:
Traceback (most recent call last):
  File "C:\Users\irams\anaconda3\lib\site-packages\sklearn\model_selection\_validation.py", line 686, in _fit_and_score
    estimator.fit(X_train, y_train, **fit_params)
  File "C:\Users\irams\anaconda3\lib\site-packages\sklearn\linear_model\_logistic.py", line 1162, in fit
    solver = _check_solver(self.solver, self.penalty, self.dual)
  File "C:\Users\irams\anaconda3\lib\site-packages\sklearn\linear_model\_logistic.py", line 54, in _check_solver
    raise ValueError(
ValueError: Solver lbfgs supports only 'l2' or 'none' penalties, got l1 penalty.

  warnings.warn(some_fits_failed_message, FitFailedWarning)
C:\Users\irams\anaconda3\lib\site-packages\sklearn\model_selection\_search.py:952: UserWarning: One or more of the test scores are non-finite: [       nan 0.94594595        nan 0.95540541        nan 0.95675676
        nan 0.95810811        nan 0.95945946        nan 0.95945946]
  warnings.warn(

Best model parameters: {'C': 10, 'penalty': 'l2'}
Cross-validation scores: [0.97297297 0.93243243 0.99324324 0.92567568 0.97297297]

In [ ]:
#4 Visualise the dataset and / or the model's results, where applicable (eg, feature importance, confusion matrix, etc).

In [ ]:
#Here’s an example of how you might create a confusion matrix visualization in Python using Matplotlib and Seaborn:

In [64]:
import matplotlib.pyplot as plt
import seaborn as sns
from sklearn.metrics import confusion_matrix

# Assuming y_true and y_pred are your true and predicted labels
cm = confusion_matrix(y_true, y_pred)

plt.figure(figsize=(10,7))
sns.heatmap(cm, annot=True, fmt='d')
plt.xlabel('Predicted')
plt.ylabel('True')
plt.show()

NameError: name 'y_true' is not defined